https://en.m.wikibooks.org/wiki/SQL_Exercises/Movie_theatres

In [ ]:
%load_ext sql
%sql sqlite:///db.db3

In [ ]:
%%sql sqlite://

CREATE TABLE Movies (
   Code INTEGER PRIMARY KEY NOT NULL,
   Title TEXT NOT NULL,
   Rating TEXT 
);
  
CREATE TABLE MovieTheaters (
   Code INTEGER PRIMARY KEY NOT NULL,
   Name TEXT NOT NULL,
   Movie INTEGER  
     CONSTRAINT fk_Movies_Code REFERENCES Movies(Code)
);

INSERT INTO Movies(Code,Title,Rating) VALUES(9,'Citizen King','G');
INSERT INTO Movies(Code,Title,Rating) VALUES(1,'Citizen Kane','PG');
INSERT INTO Movies(Code,Title,Rating) VALUES(2,'Singin'' in the Rain','G');
INSERT INTO Movies(Code,Title,Rating) VALUES(3,'The Wizard of Oz','G');
INSERT INTO Movies(Code,Title,Rating) VALUES(4,'The Quiet Man',NULL);
INSERT INTO Movies(Code,Title,Rating) VALUES(5,'North by Northwest',NULL);
INSERT INTO Movies(Code,Title,Rating) VALUES(6,'The Last Tango in Paris','NC-17');
INSERT INTO Movies(Code,Title,Rating) VALUES(7,'Some Like it Hot','PG-13');
INSERT INTO Movies(Code,Title,Rating) VALUES(8,'A Night at the Opera',NULL);
 
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(1,'Odeon',5);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(2,'Imperial',1);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(3,'Majestic',NULL);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(4,'Royale',6);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(5,'Paraiso',3);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(6,'Nickelodeon',NULL);

In [ ]:
# 1. Select the title of all movies.
%sql select title from movies;

In [ ]:
# 2. Show all the distinct ratings in the database.
%sql select distinct rating from movies;

In [ ]:
# 3. Show all unrated movies.
%sql select * from movies where rating is null;

In [ ]:
# 4. Select all movie theaters that are not currently showing a movie.
%sql select * from movietheaters where movie is null;

In [ ]:
# 5. Select all data from all movie theaters and, additionally, the data from the movie that is being shown in the theater (if one is being shown).
%sql select * from movietheaters left join movies on movietheaters.movie = movies.code;

In [ ]:
# 6. Select all data from all movies and, if that movie is being shown in a theater, show the data from the theater.
%sql select * from movies left join movietheaters on movies.code = movietheaters.movie;

In [ ]:
# 7. Show the titles of movies not currently being shown in any theaters.
%sql select title from movies left join movietheaters on movies.code = movietheaters.movie where movie is null;

In [ ]:
# 8. Add the unrated movie "One, Two, Three".
%sql insert into movies (title, rating) values ('One, Two, Three', null);

In [ ]:
# 9. Set the rating of all unrated movies to "G".
%sql update movies set rating = 'G' where rating is null;

In [ ]:
# 10. Remove movie theaters projecting movies rated "NC-17".
%sql delete from movietheaters where movie in (select code from movies where rating = 'NC-17');